/* Project:		StarWars
   File Name:	Level1.h
   Author:		阴浩
   Date:		4.26  v1.0 引擎确认

   Purpose:		关卡1的属性和函数声明
*/

#ifndef _Level1
#define _Level1

//------------------------------------------------------------------------------
// Typedef:
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// Public Consts:
//------------------------------------------------------------------------------
enum TYPE1
{
	// 游戏对象类型列表
	//飞船
	TYPE_SHIP1 = 0,
	TYPE_SHIP2,
	TYPE_SHIP3,
	//子弹
	TYPE_BULLET1,
	TYPE_BULLET2,
	TYPE_BULLET3,
	TYPE_BULLET4,
	TYPE_BULLET5,
	//敌机
	TYPE_ENEMY1,
	TYPE_ENEMY2,
	TYPE_ENEMY3,
	//技能
	TYPE_SKILL1,
	TYPE_SKILL2,
	TYPE_SKILL3,
	TYPE_SKILL4,
	TYPE_SKILL5,
	//道具
	TYPE_GOLD,
	TYPE_SHIELD,
	TYPE_LASER,
	TYPE_INVIN,

	TYPE_NUM
};
//------------------------------------------------------------------------------
// Public Structures:
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// Public Variables:
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// Public Functions:
//------------------------------------------------------------------------------

// 6个状态函数
void Load1(void);
void Ini1(void);
void Update1(void);
void Draw1(void);
void Free1(void);
void Unload1(void);

#endif