/* Project:		StarWars
	File Name:	Level1.h
	Author:		阴浩
	Date:		4.26  v1.0 引擎确认

	Purpose:		关卡1的属性和函数声明
*/

#ifndef _Level3
#define _Level3

//------------------------------------------------------------------------------
// Typedef:
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// Public Consts:
//------------------------------------------------------------------------------
enum TYPE3
{
	// 游戏对象类型列表
	//飞船
	TYPE3_SHIP1 = 0,
	TYPE3_SHIP2,
	TYPE3_SHIP3,
	//子弹
	TYPE3_BULLET1,
	TYPE3_BULLET2,
	TYPE3_BULLET3,
	TYPE3_BULLET4,
	TYPE3_BULLET5,
	//敌机
	TYPE3_ENEMY1,
	TYPE3_ENEMY2,
	TYPE3_ENEMY3,
	//技能
	TYPE3_SKILL1,
	TYPE3_SKILL2,
	TYPE3_SKILL3,
	TYPE3_SKILL4,
	TYPE3_SKILL5,
	//道具
	TYPE3_GOLD,
	TYPE3_SHIELD,
	TYPE3_LASER,
	TYPE3_INVIN,

	TYPE3_NUM
};
//------------------------------------------------------------------------------
// Public Structures:
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// Public Variables:
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// Public Functions:
//------------------------------------------------------------------------------

// 6个状态函数
void Load3(void);
void Ini3(void);
void Update3(void);
void Draw3(void);
void Free3(void);
void Unload3(void);

#endif
